Autodesk.Revit.DB.Macros.IModuleMaker.Execute(System.String)
The method that Revit will invoke to create module project.
When implementing this interface, programmer is responsible for making it exception-free
folder:
Module project folder.
Since:
2025

Autodesk.Revit.DB.Macros.IModuleMaker
The interface used to create module project.
Remarks:
Implement this interface to create module project.
Since:
2025